# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Utilisateurs\user\Documents\PSoC Creator\Workspace02\ASK.cydsn\ASK.cyprj
# Date: Mon, 25 Oct 2021 13:24:13 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Mixer_1_aclk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61 121} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {Mixer_1_aclk(fixed-function)} -period 2500 -waveform {0 1250} [get_pins {ClockBlock/aclk_glb_ff_0}]


# Component constraints for D:\Utilisateurs\user\Documents\PSoC Creator\Workspace02\ASK.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Utilisateurs\user\Documents\PSoC Creator\Workspace02\ASK.cydsn\ASK.cyprj
# Date: Mon, 25 Oct 2021 13:24:09 GMT
